package app.finup.layer.domain.news.constant;

import lombok.AccessLevel;
import lombok.NoArgsConstructor;

import java.util.Set;

/**
 * 뉴스 필터 키워드를 관리하는 상수
 * @author kcw
 * @since 2026-01-19
 */

@NoArgsConstructor(access = AccessLevel.PRIVATE)
public class NewsFilter {

    public static final Set<String> FILTER_KEYWORD_MAIN = Set.of(
            "마감 시황", "개장 시황", "출발 시황", "보합 출발", "혼조세",
            "장중 시황", "장중 등락", "오늘의 증시", "이 시각 증시", "지금 증시",
            "상한가 행진", "상한가 종목", "폭등", "급등주", "불기둥",
            "속출", "고수", "부자", "대박", "리치", "지금 사야", "매수 타이밍", "놓치면",
            "테마", "특징주", "고배율",
            "골든크로스", "데드크로스", "분배금",
            "암호화폐", "코인", "비트코인", "부동산", "외환", "금시세", "카드론",
            "정당", "지지도", "선거", "총선", "교회",
            "[속보]", "[영상]", "퀴즈", "챌린지", "이벤트", "당첨",
            "연예", "스포츠", "축구", "야구", "공연", "음악",
            "역사", "문화재", "전시", "투어",
            "株", "社", "포인트", "고용"
    );


    public static final Set<String> FILTER_KEYWORD_STOCK = Set.of(
            "마감", "개장", "출발", "보합", "혼조", "장중", "매수", "폭등세", "매도", "장 마감",
            "급등", "급등주", "불기둥", "간다", "오늘의 주식", "이 시각 증시", "체크", "점검",
            "속출", "고수", "부자", "대박", "리치",
            "테마주", "특징주", "고배율", "추천주", "관심주", "지금 사야", "매수 타이밍", "놓치면",
            "골든크로스", "데드크로스", "분배금",
            "부동산", "외환", "금시세", "카드론",
            "정당", "지지도", "선거", "총선", "교회",
            "[속보]", "[영상]", "퀴즈", "챌린지", "이벤트", "당첨"
    );

}
